Revit 2027 API
ScheduleFieldDisplayType Enumeration
 Display type of schedule field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ScheduleFieldDisplayType
Public Enumeration ScheduleFieldDisplayType
public enum class ScheduleFieldDisplayType
type ScheduleFieldDisplayType
Members
Member name | Value | Description
Max | 3 |  Calculates and displays the maximum value
Min | 4 |  Calculates and displays the minimum value
MinMax | 2 |  Calculates and displays the minimum and maximum values
Standard | 0 |  Standard: field setting for [!:Autodesk::Revit::DB::ScheduleField::MultipleValuesText] is displayed if the values of the elements are different, otherwise, the common value will be displayed
Totals | 1 |  Calculates and displays the total value
See Also
Reference
Autodesk.Revit.DB Namespace